{
  "fields": {
    "name": "Назва",
    "description": "Опис",
    "code": "Код",
    "isActive": "Активний",
    "mainImage": "Основне зображення",
    "assets": "Асети",
    "categoryParent": "Батьківська категорія",
    "categories": "Категорії",
    "channels": "Канали",
    "categoryRoute": "Дерево категорій (ID)",
    "categoryRouteName": "Дерево категорій",
    "scope": "Область застосування",
    "products": "Продукти",
    "productCategories": "Категорії продукту",
    "catalogs": "Каталоги",
    "sortOrder": "Порядок сортування"
  },
  "links": {
    "categoryParent": "Батьківська категорія",
    "categories": "Дочірні категорії",
    "assets": "Асети",
    "channels": "Канали",
    "products": "Продукти",
    "catalogs": "Каталоги",
    "productCategories": "Категорії продукту"
  },
  "labels": {
    "Create Category": "Створити категорії"
  },
  "options": {
    "шаблон": {
      "default": "За замовчуванням"
    }
  },
  "boolFilters": {
    "linkedWithProduct": "Є продукти"
  },
  "messages": {
    "channelUnlinkConfirm": "Ви впевнені, що хочете розірвати зв'язок каналу з категорією? Усі продукти, опосередковано пов'язані через категорію з каналом, також будуть відв'язані.",
    "categoryRemoveConfirm": "Ви впевнені, що хочете видалити категорію? Всі дочірні категорії будуть також видалені і всі продукти, пов'язані з цими категоріями, втратять цей самий зв'язок.",
    "categoryCatalogUnlinkConfirm": "Ви впевнені, що хочете розірвати зв'язок каталогу з деревом категорій? Всі продукти каталогу втратять зв'язок з категоріями дерева категорій.",
    "categoryParentChangeConfirm": "Ви впевнені, що хочете пов'язати цю категорію з новою батьківською категорією? Зверніть увагу, що оновлене дерево категорій буде додатково прив'язане до тих самих каталогів, що й вихідне дерево категорій. Продукти будуть відв'язані від усіх каналів, успадкованих від оригінального дерева категорій, і пов'язані з каналами, успадкованими від оновленого дерева категорій."
  },
  "exceptions": {
    "onlyRootCategoryCanBeLinked": "Тільки коренева категорія може бути пов'язана з каталогом.",
    "onlyRootCategoryCanBeUnLinked": "Тільки коренева категорія може бути від'єднана від каталогу.",
    "categoryHasChildren": "Обрана категорія використовується іншою категорією в якості батьківської і не може бути обрана в якості категорії продукту.",
    "categoryHasChildCategoryAndCantBeDeleted": "Категорія має дочірню категорію і не може бути видалена.",
    "youCanNotChooseChildCategory": "Ви не можете вибрати підкатегорію або себе.",
    "categoryHasProducts": "Категорія з пов'язаними товарами не може бути видалена.",
    "categoryCannotBeUnRelatedFromCatalog": "Дерево категорій із пов'язаними товарами не можна відключити від каталогу.",
    "parentCategoryHasProducts": "Цю категорію не можна встановити як батьківську, оскільки вона листова і має призначені їй продукти.",
    "youCanNotChangeParentCategoryInRootCategoryWithLinkedProducts": "Ви не можете змінити батьківську категорію в кореневій категорії з пов'язаними продуктами."
  }
}