{
  "fields": {
    "isActive": "Aktiv",
    "products": "Produkte",
    "scope": "Geltungsbereich",
    "mainImage": "Hauptbild",
    "sortOrder": "Sortierreihenfolge",
    "code": "Code",
    "children": "Kategorien",
    "channels": "Kanäle",
    "parents": "Hauptkategorie",
    "name": "Name",
    "description": "Beschreibung",
    "productCategories": "Kategorie-Produkte"
  },
  "options": {
    "template": {
      "default": "Standard"
    }
  },
  "boolFilters": {
    "linkedWithProduct": "Hat Produkte"
  },
  "messages": {
    "channelUnlinkConfirm": "Möchten Sie die Verknüpfung des Kanals mit der Kategorie wirklich aufheben? Alle indirekt mit diesem Kanal verknüpften Produkte werden entkoppelt.",
    "categoryRemoveConfirm": "Möchten Sie die Kategorie wirklich entfernen? Alle Unterkategorien dieser Kategorie werden ebenfalls entfernt und die Verknüpfungen der Produkte mit dieser Kategorie oder ihrer Unterkategorien werden aufgehoben.",
    "categoryParentChangeConfirm": "Möchten Sie diese Kategorie wirklich mit einer neuen übergeordneten Kategorie verknüpfen? Bitte beachten Sie, dass der aktualisierte Kategoriebaum zusätzlich denselben Katalogen wie der ursprüngliche Kategoriebaum zugeordnet wird. Die Verknüpfung der Produkte mit allen Kanälen, die vom ursprünglichen Kategoriebaum vererbt wurden, wird aufgehoben und die Verknüpfung mit den Kanälen, die vom aktualisierten Kategoriebaum vererbt wurden, wird erstellt."
  },
  "exceptions": {
    "youCanNotChangeParentCategoryInRootCategoryWithLinkedProducts": "Sie können die Parent-Kategorie in eine Stammkategorie mit den verknüpften Produkten nicht umwandeln.",
    "categoryHasChildren": "Kategorie hat untergeordnete Elemente.",
    "categoryHasChildCategoryAndCantBeDeleted": "Die Kategorie hat eine untergeordnete Kategorie und kann nicht gelöscht werden.",
    "youCanNotChooseChildCategory": "Sie können keine untergeordnete Kategorie oder sich selbst auswählen.",
    "categoryHasProducts": "Kategorie mit verknüpften Produkten kann nicht gelöscht werden.",
    "parentCategoryHasProducts": "Diese Kategorie kann nicht als übergeordnete Kategorie festgelegt werden, es ist eine Blattkategorie, die zugeordnete Produkte hat."
  }
}
