{
  "fields": {
    "productCanLinkedWithNonLeafCategories": "Erlauben, die Produkte mit allen Kategorien (nicht nur Blattkategorien) zu verlinken.",
    "behaviorOnCategoryDelete": "Verhalten beim Löschen einer Kategorie",
    "behaviorOnCategoryTreeUnlinkFromCatalog": "Verhalten beim Aufheben der Verknüpfung des Kategoriebaums mit dem Katalog",
    "behaviorOnClassificationChange": "Verhalten bei Änderung/Entfernung der Klassifizierung",
    "allowSingleClassificationForProduct": "Nur eine einzige Klassifizierung für ein Produkt zulassen"
  },
  "labels": {
    "confirmLocaleChanges": "Wenn die Sprache entfernt wird, werden alle Daten, die Sie zuvor in die mehrsprachigen Felder und Attributwerte für dieses Gebietsschema eingegeben haben, automatisch entfernt.",
    "retainAllInheritedAttributes": "Alle vererbte Attribute beibehalten",
    "removeAllInheritedAttributes": "Alle vererbte Attribute entfernen",
    "removeOnlyInheritedAttributesWithNoValue": "Nur vererbte Attribute ohne Wert entfernen"
  },
  "messages": {
    "productCanLinkedWithNonLeafCategoriesChangeConfirm": "Möchten Sie die Verknüpfung von Produkten mit den Kategorien, die keine Blatt-Kategorien sind, wirklich verbieten? Alle mit diesen Kategorien verknüpften Produkte werden automatisch entkoppelt."
  },
  "exceptions": {
    "languageUsedInChannel": "Diese Sprache wird in einem Kanal verwendet und kann nicht entfernt werden."
  },
  "queueManager": {
    "updatingOwnershipInformation": "Aktualisierung der Besiterinformationen"
  },
  "tooltips": {
    "productCanLinkedWithNonLeafCategories": "Wenn gesetzt, werden Sie die Produkte mit den Kategorien verlinken können, die Unterkategorien haben.",
    "behaviorOnCategoryDelete": "Beim \"Erweitern\" werden auch alle Unterkategorien dieser Kategorie entfernt und alle Produkte, die mit dieser Kategorie oder ihren Unterkategorien verknüpft sind, werden getrennt.",
    "behaviorOnCategoryTreeUnlinkFromCatalog": "Bei \"Erweitern\" werden alle mit den Produkten verknüpften Kategorien aus diesem Baum automatisch getrennt."
  }
}
