{
  "fields": {
    "name": "Название",
    "description": "Описание",
    "code": "Код",
    "isActive": "Активный",
    "mainImage": "Основное изображение",
    "parents": "Родительская категория",
    "categories": "Категории",
    "channels": "Каналы",
    "categoryRoute": "Дерево категорий (ID)",
    "categoryRouteName": "Дерево категорий",
    "scope": "Область применения",
    "products": "Продукты",
    "productCategories": "Категории продукта",
    "catalogs": "Каталоги",
    "sortOrder": "Порядок сортировки"
  },
  "options": {
    "template": {
      "default": "По умолчанию"
    }
  },
  "boolFilters": {
    "linkedWithProduct": "Есть продукты"
  },
  "messages": {
    "channelUnlinkConfirm": "Вы уверены, что хотите разорвать связь канала с категорией? Все продукты, косвенно связанные через категорию с каналом, также будут отвязаны.",
    "categoryRemoveConfirm": "Вы уверены, что хотите удалить категорию? Все дочерние категории будут также удалены и все продукты связанные с этими категориями потеряют эту самую связь.",
    "categoryCatalogUnlinkConfirm": "Вы уверены, что хотите разорвать связь каталога с деревом категорий? Все продукты каталога потеряют связь з категориями дерева категорий.",
    "categoryParentChangeConfirm": "Вы уверены, что хотите связать эту категорию с новой родительской категорией? Учтите, что обновленное дерево категорий будет дополнительно привязано к тем же каталогам, что и исходное дерево категорий. Продукты будут отвязаны от всех каналов, унаследованных от исходного дерева категорий, и\nсвязаны с каналами, унаследованными от обновленного дерева категорий."
  },
  "exceptions": {
    "onlyRootCategoryCanBeLinked": "Только корневая категория может быть связана с каталогом.",
    "onlyRootCategoryCanBeUnLinked": "Только корневая категория может быть отсоединена от каталога.",
    "categoryHasChildren": "Выбранная категория используется другой категорией в качестве родительской и не может быть выбрана в качестве категории продукта.",
    "categoryHasChildCategoryAndCantBeDeleted": "Категория имеет дочернюю категорию и не может быть удалена.",
    "youCanNotChooseChildCategory": "Вы не можете выбрать подкатегорию или себя.",
    "categoryHasProducts": "Категория со связанными товарами не может быть удалена.",
    "categoryCannotBeUnRelatedFromCatalog": "Дерево категорий со связанными товарами нельзя отключить от каталога.",
    "parentCategoryHasProducts": "Эту категорию нельзя установить как родительскую, так как она листовая и имеет назначенные ей продукты.",
    "youCanNotChangeParentCategoryInRootCategoryWithLinkedProducts": "Вы не можете изменить родительскую категорию в корневой категории со связанными продуктами."
  }
}
