{
  "fields": {
    "name": "Название",
    "description": "Описание",
    "code": "Код",
    "isActive": "Активный",
    "assets": "Ассеты",
    "categoryParent": "Родительская категория",
    "categories": "Категории",
    "channels": "Каналы",
    "image": "Основное изображение",
    "categoryRouteName": "Дерево категорий",
    "scope": "Область применения",
    "productCategories": "Категории продукта",
    "catalogs": "Каталоги"
  },
  "links": {
    "categoryParent": "Родительская категория",
    "categories": "Дочерние Категории",
    "assets": "Ассеты",
    "channels": "Каналы",
    "catalogs": "Каталоги",
    "productCategories": "Категории продукта"
  },
  "labels": {
    "Create Category": "Создать категории"
  },
  "messages": {
    "channelUnlinkConfirm": "Вы уверены, что хотите разорвать связь канала с деревом категорий? Все продукты, косвенно связанные через дерево категорий с каналом, также будут отлинкованы.",
    "categoryRemoveConfirm": "Вы уверены, что хотите удалить категорию? Все дочерние категории будут также удалены и все продукты связанные с этими категориями потеряют эту самую связь.",
    "categoryCatalogUnlinkConfirm": "Вы уверены, что хотите разорвать связь каталога с деревом категорий? Все продукты каталога потеряют связь з категориями дерева категорий.",
    "categoryParentChangeConfirm": "Вы уверены, что хотите связать эту категорию с новой родительской категорией? Учтите, что обновленное дерево категорий будет дополнительно привязано к тем же каталогам, что и исходное дерево категорий. Продукты будут отвязаны от всех каналов, унаследованных от исходного дерева категорий, и\nсвязаны с каналами, унаследованными от обновленного дерева категорий."
  },
  "exceptions": {
    "categoryHasChildren": "Выбранная категория используется другой категорией в качестве родительской и не может быть выбрана в качестве категории продукта.",
    "categoryHasChildCategoryAndCantBeDeleted": "Категория имеет дочернюю категорию и не может быть удалена.",
    "youCanNotChooseChildCategory": "Вы не можете выбрать дочернюю категорию.",
    "categoryHasProducts": "Категория со связанными товарами не может быть удалена.",
    "categoryCannotBeUnRelatedFromCatalog": "Дерево категорий со связанными товарами нельзя отключить от каталога.",
    "parentCategoryHasProducts": "Эту категорию нельзя установить как родительскую, так как она листовая и имеет назначенные ей продукты.",
    "youCanNotChangeParentCategoryInRootCategoryWithLinkedProducts": "Вы не можете изменить родительскую категорию в корневой категории со связанными продуктами."
  }
}
